doc/planning.tex
% Created 2018-01-26 Fri 03:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Joshua Suskalo}
\date{January 25th, 2018}
\title{Sleep Well/handmade-clojure planning document}
\hypersetup{
 pdfauthor={Joshua Suskalo},
 pdftitle={Sleep Well/handmade-clojure planning document},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.1.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{3}
\tableofcontents


\section{Game Design}
\label{sec:orgee09a9e}
The game is currently planned to be the game Cassie and I have planned on before, "Sleep Well"
\section{Art Design}
\label{sec:org13dfd4f}
\section{Sound Design}
\label{sec:org23b1086}
\section{Game Development}
\label{sec:orgc249232}
\subsection{Architecture}
\label{sec:org738ef3f}
\subsubsection{Entity/Component System}
\label{sec:orgd75571b}
\begin{enumerate}
\item Example Usage
\label{sec:orga1ee5e6}
\begin{verbatim}
(defcomponent health-comp [num] number?)

(defcomponent player-input [x y jump]
        (s/keys :req-un [::x ::y ::jump])
        {:x 0 :y 0 :jump false})
\end{verbatim}
\begin{verbatim}
(register-entity (create-health-comp 5)
                 (create-position 2 2)
                 (create-image-texture (sprite "Monster.png")))

(register-entity (create-player-input)
                 (create-position 0 0)
                 (create-image-texture (sprite "Player.png")))
\end{verbatim}
\begin{verbatim}
(defsystem damage-over-time
  :on-update
  [health :health-comp]
  (fn [entity-id]
      (update-component-state! health dec)))

(defsystem player-movement
  :on-update
  [input :player-input
   position :position]
  (fn [entity-id]
    (let [x (:x input)
          y (:y input)]
      (update-component-state! position move x y)))

(defsystem render-sprites
  :post-update
  [texture :image-texture]
  (fn ...))

(defsystem kill-all
  :on-call
  [health :health-comp]
  (fn [entity-id]
    (destroy-entity! entity-id)))
\end{verbatim}
\item Internal Structure
\label{sec:org2a02b37}
\begin{enumerate}
\item Systems
\label{sec:orga629c32}

Systems run over either all entities, or components of a specific set of types. When running over a
set of types,  it selects the shortest list of entities from the component types, and then iterates
over them,  filtering by only the entities which have the other required components.  This requires
minimal iteration and makes use of the hashmap lookup speed granted for looking up entities.

Systems are kicked off by a simple function call, and some systems are put in a near-infinite loop.
Systems are permitted to fire off other systems, however in these cases the functions that are used
to fire off the other systems should do so concurrently and return immediately to prevent the first
system from being blocked.
\item Entities
\label{sec:org8dff2fe}

Entities are simple unique ids, generated for each entity to identify them. Once you can
identify an entity, all its data and associated behaviour can be found in components and
the systems that operate on them.
\item Components
\label{sec:orgf4c4cc5}

Components are where all the data for the entire game's high-level systems will be stored.
Systems can operate over components.

A component has several parts,  a component id, which is a namespaced keyword to uniquely
identify it by name, and a spec (tied to the same namespaced keyword), which declares the
data which will be stored inside the component.
\item Data
\label{sec:orgff78f3e}

Internal storage will be as follows:
\begin{itemize}
\item An atom which is simply a list of all entity ids
\item An atom which maps entity ids to component ids and component data ids
\begin{itemize}
\item This atom should have a two-way mapping, from entities to components, and vice-versa
(Maybe don't have it two way, and only do it as a mapping from components to entities?
 Having it be two way can make it more efficient though for systems to do lookups.)
\end{itemize}
\item An atom which maps from component ids to refs that store component data
\begin{itemize}
\item A ref per component type (stored in the above atom) which maps component data ids to data stored
\end{itemize}
\end{itemize}
\item Assemblages
\label{sec:org9856d5b}

Assemblages or entity-templates are mappings of template-ids to lists of components and their initial
data, such that a generic method could be created to take an assemblage and return an entity with all
the required components and initial data.
\end{enumerate}
\end{enumerate}

\subsubsection{Physics}
\label{sec:orgab6b3a5}
\subsubsection{Renderer}
\label{sec:org21a872e}

The renderer should be using recent OpenGL features so that GLSL can be used instead of software
rendering.  OpenGL 4 should most  likely be the feature set that's used,  though I can pick what
subversion later.
\subsection{Tasks}
\label{sec:org48f7c57}
\end{document}